<a href="https://colab.research.google.com/github/matsunori39/Introduction-to-SQL-3rd-Edition/blob/main/Introduction_to_SQL_3rd_Edition.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

https://book.impress.co.jp/books/1121101090

In [1]:
!pip install ipython-sql -q

In [2]:
# Loading ipython-sql
%load_ext sql

# Connecting to SQLite
%sql sqlite:///tmp.sqlite3

'Connected: @tmp.sqlite3'

# Part1 Getting Started with SQL

## Chapter 1 First SQL

### 1.2 First SQL

#### 1.2.1 Try SQL

In [3]:
%%sql
CREATE TABLE book (
  date DATE,
  item VARCHAR(30),
  memo VARCHAR(30),
  received INT,
  payment INT);
INSERT INTO book (date, item, memo, received, payment) VALUES ('2022-02-03', 'Food Expense' , 'Buy Coffee' , 0, 380);
INSERT INTO book (date, item, memo, received, payment) VALUES ('2022-02-10', 'Salary' , 'Jan. Salary' , 280000, 0);
INSERT INTO book (date, item, memo, received, payment) VALUES ('2022-02-11', 'Culture and Recreation Expenses' , 'Buy Books' , 0, 2800);
INSERT INTO book (date, item, memo, received, payment) VALUES ('2022-02-14', 'Entertainment Expenses' , 'Dues for Synchronization Meetings' , 0, 5000);
INSERT INTO book (date, item, memo, received, payment) VALUES ('2022-02-18', 'Utilities Charge' , 'Electricity Bill in Jan.' , 0, 7560);

 * sqlite:///tmp.sqlite3
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

#### 1.2.2 Let's search

##### First time search

In [4]:
%%sql
SELECT payment
  FROM book

 * sqlite:///tmp.sqlite3
Done.

[(380,), (0,), (2800,), (5000,), (7560,)]

##### Search all columns

In [5]:
%%sql
SELECT date, item, memo, received, payment
  FROM book

 * sqlite:///tmp.sqlite3
Done.

[('2022-02-03', 'Food Expense', 'Buy Coffee', 0, 380),
 ('2022-02-10', 'Salary', 'Jan. Salary', 280000, 0),
 ('2022-02-11', 'Culture and Recreation Expenses', 'Buy Books', 0, 2800),
 ('2022-02-14', 'Entertainment Expenses', 'Dues for Synchronization Meetings', 0, 5000),
 ('2022-02-18', 'Utilities Charge', 'Electricity Bill in Jan.', 0, 7560)]

##### Search all columns (simplified notation)

In [6]:
%%sql
SELECT *
  FROM book

 * sqlite:///tmp.sqlite3
Done.

[('2022-02-03', 'Food Expense', 'Buy Coffee', 0, 380),
 ('2022-02-10', 'Salary', 'Jan. Salary', 280000, 0),
 ('2022-02-11', 'Culture and Recreation Expenses', 'Buy Books', 0, 2800),
 ('2022-02-14', 'Entertainment Expenses', 'Dues for Synchronization Meetings', 0, 5000),
 ('2022-02-18', 'Utilities Charge', 'Electricity Bill in Jan.', 0, 7560)]

#### 1.2.3 Conditional Search

##### Obtain only lines where the amount of withdrawal exceeds &yen;3,000

In [7]:
%%sql
SELECT date, item, payment
  FROM book
  WHERE payment > 3000

 * sqlite:///tmp.sqlite3
Done.

[('2022-02-14', 'Entertainment Expenses', 5000),
 ('2022-02-18', 'Utilities Charge', 7560)]

#### 1.2.4 Let's add some data.

##### Insert rent payment in March as line

In [8]:
%%sql
INSERT INTO book
  VALUES ('2022-02-25', 'Rent', 'March Rent', 0, 85000)

 * sqlite:///tmp.sqlite3
1 rows affected.

[]

In [9]:
%%sql
SELECT * FROM book

 * sqlite:///tmp.sqlite3
Done.

[('2022-02-03', 'Food Expense', 'Buy Coffee', 0, 380),
 ('2022-02-10', 'Salary', 'Jan. Salary', 280000, 0),
 ('2022-02-11', 'Culture and Recreation Expenses', 'Buy Books', 0, 2800),
 ('2022-02-14', 'Entertainment Expenses', 'Dues for Synchronization Meetings', 0, 5000),
 ('2022-02-18', 'Utilities Charge', 'Electricity Bill in Jan.', 0, 7560),
 ('2022-02-25', 'Rent', 'March Rent', 0, 85000)]